src/cfe/КСП/InformationRegisters/ксп_ВыводИзОборотаИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ВыводИзОборотаИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДвиженияКМФулфилмент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДвиженияКМФулфилмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВыводИзОборотаИСМП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыводИзОборотаИСМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_ВыводИзОборотаИСМП/Ext/ManagerModule.bsl
// Создает запись при загрузке КМ от оператора фулфилмента (Profashion solutions)
//
// Параметры:
//	ДокДвиженияКМФулфилмент 	- док ссылка  - ДвиженияКМФулфилмент
//
Процедура ДобавитьЗаписьСПустымВыводомИзОборота(ДокДвиженияКМФулфилмент) Экспорт
	
	НЗ = РегистрыСведений.ксп_ВыводИзОборотаИСМП.СоздатьНаборЗаписей();
	НЗ.Отбор.ДвиженияКМФулфилмент.Установить(ДокДвиженияКМФулфилмент);
	НЗ.Отбор.ВыводИзОборотаИСМП.Установить(Неопределено);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ДвиженияКМФулфилмент = ДокДвиженияКМФулфилмент;
	НовСтр.ВыводИзОборотаИСМП = Неопределено;
	НовСтр.ВремяСоздания = ТекущаяДатаСеанса();
	
	НЗ.Записать();
		
КонецПроцедуры


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьВыводИзОборота(ДокДвиженияКМФулфилмент, ВыводИзОборотаИСМП) Экспорт

	НЗ = РегистрыСведений.ксп_ВыводИзОборотаИСМП.СоздатьНаборЗаписей();
	НЗ.Отбор.ДвиженияКМФулфилмент.Установить(ДокДвиженияКМФулфилмент);
	НЗ.Очистить();
	
	НовСтр = НЗ.Добавить();
	НовСтр.ДвиженияКМФулфилмент = ДокДвиженияКМФулфилмент;
	НовСтр.ВыводИзОборотаИСМП = ВыводИзОборотаИСМП;
	НовСтр.ВремяСоздания = ТекущаяДатаСеанса();
	
	НЗ.Записать();
	
КонецПроцедуры
